Repository: joaopedrocoelho/easy_weight
Catalog: lib/l10n/app_*.arb
Languages: be, ga, ku, lb, lo, mg, mi, mt, my, or, ps, sd, tg, ug

# addCurrentWeight
source: Add your current weight to start
be: Дадаць бягучы вага, каб пачаць
ga: Cuir do mheáchan reatha le tosú
ku: Ji bo destpêkirina giraniya xweya heyî zêde bikin
lb: Füügt Är aktuell Gewiicht fir unzefänken
lo: ຕື່ມນ້ໍາຫນັກຂອງທ່ານໃນປະຈຸບັນເພື່ອເລີ່ມຕົ້ນ
mg: Ampio ny lanjanao ankehitriny hanombohana
mi: Tāpirihia to taumaha o naianei hei tiimata
mt: Żid il-piż kurrenti tiegħek biex tibda
my: သင်၏လက်ရှိအလေးချိန်ကိုစတင်ရန်ထည့်ပါ
or: ଆରମ୍ଭ କରିବାକୁ ତୁମର ସାମ୍ପ୍ରତିକ ଓଜନ ଯୋଡ |
ps: د پیل لپاره خپل اوسنی وزن اضافه کړئ
sd: پنهنجو موجوده وزن شروع ڪرڻ لاء شامل ڪريو
tg: Вазни ҷории худро илова кунед
ug: نۆۋەتتىكى ئېغىرلىقىڭىزنى قوشۇڭ

# currentWeight
source: Current
be: Плынь
ga: Reatha
ku: Vêga
lb: Alsstaugewd
lo: ປະຈຸບັນ
mg: amin'izao fotoana izao
mi: Kua tū kē
mt: Kurrenti
my: ယခု
or: ସାମ୍ପ୍ରତିକ
ps: روانه
sd: موجوده
tg: Ҷорӣ
ug: نۆۋەتتىكى

# weekStat
source: Week
be: Тыдзень
ga: Seachtain
ku: Hefte
lb: Woch
lo: ອາທິດ
mg: Herinandro
mi: Wiki
mt: Ġimgħa
my: ရက်သတ္တပတ်
or: ସପ୍ତାହ
ps: اونۍ
sd: هفتو
tg: Ҳафта
ug: ھەپتە

# monthStat
source: Month
be: Месяц
ga: Mí
ku: Meh
lb: Mount
lo: ເດືອນ
mg: VOLANA
mi: Marama
mt: Xahar
my: လ
or: ମାସ
ps: میاشت
sd: مهينو
tg: Моҳ
ug: ئاي

# totalStat
source: Total
be: Агульны
ga: Iomlán
ku: Hemî
lb: Ganzen
lo: ທັງຫມົດ
mg: sokajy
mi: Pupūtanga
my: လုံးဝသော
or: ସମୁଦାୟ
ps: ټول
sd: ڪل
tg: Ьамъбастӣ
ug: ئومۇمىي

# goalWeight
source: Goal
be: Вароты
ga: Sprioc
ku: Armanc
lb: Goalbesëtz
lo: ເປົ້າຫມາຍ
mg: tanjona
mi: Whāinga
mt: Għan
my: ရည်မှန်းချက်
or: ଲକ୍ଷ୍ୟ
ps: هدف
sd: مقصد
tg: Гол
ug: نىشان

# goalRemaining
source: Left
be: Левы
ga: Ar an eite chlé
ku: Çep
lb: Sech bleiwen
lo: ກ່ໍາ
mg: ANKA
mi: Mauī
mt: Xellug
my: လက်ဝဲဘက်ဖြစ်သော
or: ବାମ
ps: پاتې
sd: کاٻو
tg: Бесоҳибмонда

# addGoal
source: Set a goal
be: Усталюйце мэта
ga: Socraigh sprioc
ku: Armancek danîn
lb: E Zil gesat
lo: ກໍານົດເປົ້າຫມາຍ
mg: Mametraha tanjona
mi: Whakaritea he whaainga
mt: Issettja mira
my: ရည်မှန်းချက်ထား
or: ଏକ ଲକ୍ଷ୍ୟ ସ୍ଥିର କରନ୍ତୁ |
ps: یو هدف وټاکئ
sd: مقصد مقرر ڪريو
tg: Ҳадафро таъин кунед
ug: نىشان بەلگىلەڭ

# addRecord
source: Add a record
be: Дадаць запіс
ga: Cuir taifead leis
ku: Tomarek zêde bikin
lb: Füügt e Rekord
lo: ຕື່ມການບັນທຶກ
mg: Asio rakitsoratra
mi: Tāpirihia he rekoata
mt: Żid rekord
my: စံချိန်ထည့်ပါ
or: ଏକ ରେକର୍ଡ ଯୋଡନ୍ତୁ |
ps: ریکارډ اضافه کړئ
sd: رڪارڊ شامل ڪيو
tg: Илова кардани сабт
ug: خاتىرە قوشۇڭ

# weightHint
source: Weight
be: Вага
ga: Ualach
ku: Pîvan
lb: Gewun Du
lo: ນ້ໍາຫນັກ
mg: Lanja
mi: Taumaha
mt: Piż
my: အလေးချိန်
or: ଓଜନ
ps: وزن
sd: وزن جو وزن
tg: Вазни
ug: ئېغىرلىقى

# weightError
source: Please enter weight
be: Калі ласка, увядзіце вага
ga: Cuir isteach an meáchan le do thoil
ku: Ji kerema xwe giraniya xwe binivîse
lb: Gitt weg Gewiicht un
lo: ກະລຸນາໃສ່ນ້ໍາຫນັກ
mg: Ampidiro ny lanjany
mi: Tomo koa ki te taumaha
mt: Jekk jogħġbok ikteb il-piż
my: ကျေးဇူးပြုပြီးအလေးချိန်ထည့်ပါ
or: ଦୟାକରି ଓଜନ ପ୍ରବେଶ କରନ୍ତୁ |
ps: مهرباني وکړئ وزن دننه کړئ
sd: مهرباني ڪري وزن ۾ داخل ڪريو
tg: Лутфан, вазнро ворид кунед
ug: ئېغىرلىقنى كىرگۈزۈڭ

# noteHint
source: Add note
be: Дадаць каментарый
ga: Cuir nóta
ku: Nîşe zêde bikin
lb: Füügt Notiz Füügt
lo: ເພີ່ມຈົດຫມາຍ
mg: Manampia fanamarihana
mi: Tāpiri tuhipoka
mt: Żid Nota
my: မှတ်စုထည့်ပါ
or: ଟିପ୍ପଣୀ ଯୋଡନ୍ତୁ
ps: نوټ اضافه کړئ
sd: نوٽڻ
tg: Иловаи ёддошт
ug: خاتىرە قوشۇڭ

# cancelBtn
source: Cancel
be: Ануляваць
ga: Cealaigh
ku: Bişûndekirin
lb: Ofbriechen
lo: ຍົກເລີກ
mg: hanafoana
mi: Whakakore
mt: Ikkanċella
my: ပျက်စေ
or: ବାତିଲ୍ କରନ୍ତୁ |
ps: لغوه کول
sd: رد ڪري
tg: Манъ кардан
ug: بىكار قىلىش

# saveBtn
source: Save
be: Ратаваць
ga: Sáraigh
ku: Rizgarkirin
lb: Spuerwäit
lo: ປະຢັດ
mg: afa-tsy
mi: Whakaora
my: ကယ်ဆယ်
or: ସଞ୍ଚୟ କରନ୍ତୁ |
ps: خوندي کړئ
sd: سڪرو
tg: Пул захира кардан
ug: تېجەڭ

source: Edit record
be: Рэдагаваць запіс
ga: Cuir taifead in eagar
ku: Record Record
lb: Ännerung Rekord
lo: ການດັດແກ້ບັນທຶກ
mg: Hanova ny firaketana
mi: Whakatika Record
mt: Edit Rekord
my: တည်းဖြတ်မှတ်တမ်း
or: ରେକର୍ଡ ସଂପାଦନ କରନ୍ତୁ |
ps: ریکارډ
sd: تبديلي آڻيو
tg: Таҳрири сабт
ug: خاتىرىنى تەھرىرلەش

source: Profiles
be: Профілі
ga: Próifílí
lb: Profiler
lo: ຂໍ້ມູນ
mg: mombamomba
mi: Ngā kōtaha
mt: Profili
or: ପ୍ରୋଫାଇଲ୍
ps: پروفایلونه
sd: پروفائل
tg: Профилҳо
ug: ئارخىپلار

source: No name
be: Няма імя
ga: Gan ainm
lb: Kee Numm
lo: ບໍ່​ມີ​ຊື່
mg: Tsy misy anarana
mi: Kaore he ingoa
mt: Bla isem
my: နာမည်မရှိဘူး
or: ନାମ ନାହିଁ
ps: نوم نلری
sd: نالو ڪونهي
tg: Не ном

source: gender
be: гендэр
ga: inscne
ku: Silenda
lb: Schbel
lo: ເພດ
mg: lahy sy ny vavy
mi: tohunga
mt: Sess
my: ကျားကန်
or: ଲିଙ୍ଗ
ps: جنسیت
sd: جنهن جو ڀليڪار
tg: ҷиноят
ug: جىنسى

source: height
be: вышыня
ga: uaineacht
ku: bilindî
lb: Héicht
lo: ລວງສູງ
mg: hahavony
mi: tōroa
mt: għoli
my: အမြင့်
or: ଉଚ୍ଚତା |
ps: لوړوالی
sd: اوچائي
tg: баландӣ
ug: ئېگىزلىكى

source: birthday
be: дзень нараджэння
ga: Breithlá
ku: Rojbûn
lb: Gebuertsdag
lo: ວັນເກີດ
mg: fitsingerenan'ny andro nahaterahana
mi: rā huritau
my: မေွးနေ့
or: ଜନ୍ମଦିନ
ps: د زیږیدو نیټه
sd: سالگراه
tg: рӯзи таваллуд
ug: تۇغۇلغان كۈنى

source: color
be: колер
ga: dath a chur ar
ku: reng
lb: Faarf trëfant
lo: ສີ
mg: loko
mi: tae
mt: Kulur
my: အရောင်
or: ରଙ୍ଗ
ps: رنګ
sd: رنگ
tg: ранг
ug: رەڭ

# pickColor
source: Pick a Color
be: Выбраць колер
ga: Roghnaigh dath
ku: Rengek hilbijêrin
lb: Wielt eng Faarf
lo: ເລືອກສີ
mg: Mifidiana loko
mi: Whiriwhiria he tae
mt: Pick Kulur
my: အရောင်ရွေးပါ
or: ଏକ ରଙ୍ଗ ବାଛନ୍ତୁ |
ps: یو رنګ واخله
sd: هڪ رنگ چونڊيو
tg: Рангро интихоб кунед
ug: رەڭ تاللاڭ

# addProfile
source: Add a profile
be: Дадаць профіль
ga: Cuir próifíl leis
ku: Profîl zêde bikin
lb: Füügt e Profil
lo: ເພີ່ມໂປຼໄຟລ໌
mg: Manampia mombamomba iray
mi: Tāpirihia he kōtaha
mt: Żid profil
my: ပရိုဖိုင်းတစ်ခုကိုထည့်ပါ
or: ଏକ ପ୍ରୋଫାଇଲ୍ ଯୋଡନ୍ତୁ |
ps: یو پروفایل اضافه کړئ
sd: پروفائل شامل ڪيو
tg: Илова кардани профил
ug: ئارخىپ قوشۇڭ

# nameError
source: Please enter a name
be: Калі ласка, увядзіце імя
ga: Cuir isteach ainm le do thoil
ku: Ji kerema xwe navek binivîse
lb: Gitt w.e.g. en Numm un
lo: ກະລຸນາໃສ່ຊື່
mg: Azafady ampidiro anarana
mi: Tomo koa he ingoa
mt: Jekk jogħġbok ikteb isem
my: ကျေးဇူးပြု. နာမည်ထည့်ပါ
or: ଦୟାକରି ଏକ ନାମ ପ୍ରବେଶ କରନ୍ତୁ |
ps: مهرباني وکړئ یو نوم دننه کړئ
sd: مهرباني ڪري نالو داخل ڪريو
tg: Лутфан номро ворид кунед
ug: ئىسىم كىرگۈزۈڭ

# nameHint
source: Name
be: Імя
ga: Ainm a thabhairt ar
ku: Nav
lb: Numm vum Numm
lo: ຊື່
mg: Anarana
mi: Ingoa
mt: Isem
my: နံမယ်
or: ନାମ
ps: نوم
sd: نالو
tg: Ном

# emojiHint
source: Emoji
or: ଇମୋଜି |
ps: اموجي
sd: ايميوجي
tg: Иможи

source: Edit profile
be: Рэдагаваць профіль
ga: Cuir próifíl in eagar
ku: Profile Profile
lb: Ëffentlecht
lo: ດັດແກ້ຂໍ້ມູນ
mg: Profile edit
mi: Whakatika Profile
mt: Edit Profil
my: သင့်ရဲ့ကိုယ့်ရေးကိုယ်တာကိုပြုပြင်ရန်
or: ପ୍ରୋଫାଇଲ୍ ଏଡ଼ିଟ୍ କରନ୍ତୁ
ps: پېژندڅیه
sd: پروفائل ۾ مٽ سٽ ڪيو
tg: Таҳрири профил
ug: ئارخىپنى ئارخىپ:

# deleteProfileDialog
source: Are you sure you want to delete this profile?
be: Вы ўпэўненыя, што жадаеце выдаліць гэты профіль?
ga: An bhfuil tú cinnte gur mian leat an phróifíl seo a scriosadh?
ku: Ma hûn guman dikin ku hûn dixwazin vê profîla jêbirin?
lb: Sidd Dir sécher, datt Dir dëse Profil läsche wëllt?
lo: ທ່ານແນ່ໃຈບໍ່ວ່າທ່ານຕ້ອງການລຶບໂປຣໄຟລ໌ນີ້?
mg: Azo antoka ve fa te hamafa ity mombamomba ity ianao?
mi: Kei te mohio koe kei te hiahia koe ki te muku i tenei whaarangi?
mt: Inti żgur li trid tħassar dan il-profil?
my: ဒီပရိုဖိုင်ကိုသင်ဖျက်ချင်ပါသလား။
or: ଆପଣ ନିଶ୍ଚିତ କି ଆପଣ ଏହି ପ୍ରୋଫାଇଲ୍ ବିଲୋପ କରିବାକୁ ଚାହୁଁଛନ୍ତି?
ps: ایا ته باوري یې چې دا پروفایل حذف کول غواړې؟
sd: ڇا توهان پڪ آهيو ته توهان هن پروفائل کي ختم ڪرڻ چاهيو ٿا؟
tg: Шумо мутмаин ҳастед, ки мехоҳед ин профилро нест кунед?
ug: بۇ ئارخىپنى ئۆچۈرمەكچىمۇ?

source: Male
be: Мужчынскі
ga: Fireann
ku: Nêrî
lb: Männlech
lo: ຜູ້​ຊາຍ
mg: Lahy
mi: Tāne
mt: Malli
my: ယောကျ်ားဖြစ်သော
or: ପୁରୁଷ
ps: نارینه
sd: مرد
tg: Мардона
ug: ئەر

source: Female
be: Жанчына
ga: Bean
ku: Mê
lb: Wei eng weiblech
lo: ເພດຍິງ
mg: vehivavy
mi: Wahine
mt: Femminil
my: မိန်းမ
or: ମହିଳା
ps: ښځينه
sd: عورت
tg: Занона
ug: ئايال

source: Non binary
be: Не двайковы
ga: Neamhábartha
lb: Net binär
lo: ບໍ່ແມ່ນຖານສອງ
mi: Kore-rua
mt: Mhux Binarju
or: ଅଣ ବାଇନାରୀ |
ps: غیر بائنری
sd: غير بصر
tg: Набера
ug: ئىككىلىك ئەمەس

source: Transgender
be: Пераездраўноўваць
ga: Trasineaslú
lb: Ektenderled Zill Zender
lo: ຜູ້ຢິງຫັນເປັນ
my: လိင်ပြောင်းလဲခြင်း
or: ଟ୍ରାନ୍ସଜେଣ୍ଡର
ps: انتقال
sd: ٽرانسگيڊر
tg: Трансгендер
ug: StageGender

source: Intersex
be: Паўсіўны
ga: Idirsex
ku: Interex
lo: Intheex
mi: Pāhekoheko
my: အပြန်အလှန်ကြား
or: ଆନ୍ତରିକ
ps: انټرسیکس
sd: داخل ٿيو
tg: Index

source: Other
be: Іншы
ga: Eile
ku: Yên din
lb: Aner
lo: ອື່ນ
mg: Hafa
mi: Ētahi atu
mt: Oħrajn
my: အခြား
or: ଅନ୍ୟ
ps: نور
sd: ٻيو
tg: Дигар

# proOfferingDesc
source: Unlimited profiles and no ads
be: Неабмежаваныя профілі і без рэкламы
ga: Próifílí neamhtheoranta agus gan aon fhógraí
ku: Profîlên bêsînor û bê reklam
lo: ຂໍ້ມູນທີ່ບໍ່ຈໍາກັດແລະບໍ່ມີໂຄສະນາ
mg: Ny mombamomba tsy manam-petra ary tsy misy doka
mi: He Kōwhiringa Koreutu me te Kore Ads
mt: Profili bla limitu u l-ebda reklami
my: အကန့်အသတ်မရှိ profile များနှင့်အဘယ်သူမျှမကြော်ငြာ
or: ଅସୀମିତ ପ୍ରୋଫାଇଲ୍ ଏବଂ କ p ଣସି ବିଜ୍ଞାପନ ନାହିଁ |
sd: لامحدود پروفائيل ۽ ڪوبه اشتهار نه
tg: Профилҳои номаҳдуд ва на таблиғ
ug: چەكسىز ئارخىپلار ۋە ئېلان يوق

source: buy
be: купляць
ga: ceannaigh
ku: kirrîn
lo: ຊື້
mi: hoko
my: ဝယ်ခြမ်း
or: କିଣ |
sd: خريداري ڪريو
tg: харидан
ug: سېتىۋېلىش

# purchaseError2
source: There was a problem with the Play Store
be: Быў праблема з Play Store
ga: Bhí fadhb leis an siopa súgartha
ku: Di firotgeha lîstikê de pirsgirêkek çêbû
lo: ມີປັນຫາກັບການຫຼີ້ນຫຼີ້ນ
mg: Nisy olana tamin'ny fivarotana Play
mi: He raru kei te toa takaro
mt: Kien hemm problema bil-maħżen tal-logħob
my: Play စတိုးနှင့်ပြ a နာတစ်ခုရှိခဲ့သည်
or: ପ୍ଲେ ଷ୍ଟୋରରେ ଏକ ସମସ୍ୟା ଥିଲା |
sd: راند جي دڪان سان هڪ مسئلو هو
tg: Бо мағозаи бозӣ мушкиле буд
ug: ئويۇن دۇكىنىدا مەسىلە كۆرۈلدى

# purchaseError20
source: The payment is pending. Please check your Play Store account
be: Аплата знаходзіцца на разглядзе.Калі ласка, праверце рахунак Play Store
ga: Tá an íocaíocht ar feitheamh.Seiceáil do Chuntas Siopa Súgartha le do thoil
ku: Dravê li benda ye.Ji kerema xwe hesabê Store Store-ê xwe kontrol bikin
lo: ການຈ່າຍເງິນແມ່ນຍັງຄ້າງຢູ່.ກະລຸນາກວດເບິ່ງບັນຊີ Play Store ຂອງທ່ານ
mg: Miandry ny fandoavam-bola.Azafady mba jereo ny kaontinao Play Store
mi: Kei te tatari te utu.Tena tirohia to putea Toa Toa
mt: Il-ħlas huwa pendenti.Jekk jogħġbok iċċekkja l-kont tal-maħżen tal-logħob tiegħek
my: ငွေပေးချေမှုဆိုင်းငံ့ထားသည်။ကျေးဇူးပြု. သင်၏ Play Store အကောင့်ကိုစစ်ဆေးပါ
or: ଦେୟ ବିଚାରାଧୀନ ଅଛି |ଦୟାକରି ଆପଣଙ୍କର ନାଟକ ଷ୍ଟୋର ଆକାଉଣ୍ଟ ଯାଞ୍ଚ କରନ୍ତୁ |
sd: ادائيگي رڪيل آهي.مهرباني ڪري پنهنجو راند اسٽور اڪائونٽ چيڪ ڪريو
tg: Пардохт дар интизорӣ аст.Лутфан ҳисоби Store Store-ро санҷед
ug: پۇل تۆلەش ساقلىنىۋاتىدۇ.ئويۇن دۇكىنىڭىزنىڭ ھېساباتىنى تەكشۈرۈپ بېقىڭ

# purchaseSuccess
source: Purchase successful
be: Купля паспяховай
ga: Ceannach rathúil
ku: Kirîna serfiraz
lo: ການຊື້ທີ່ປະສົບຜົນສໍາເລັດ
mg: Fividianana mahomby
mi: Te hoko angitu
mt: Xiri ta 'suċċess
my: အောင်မြင်စွာဝယ်ယူပါ
or: ସଫଳ କିଣ |
sd: ڪامياب ڪامياب
tg: ХУЛОСА МО
ug: مۇۋەپپەقىيەت قازاندى
